src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <registerRecords>AccumulationRegister.УчетЗатрат</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>CalculationRegister.Начисления</registerRecords>
  <attributes>
    <name>ПериодНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботыСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательРасчета</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/CalculationRegisters/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Начисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ГрафикиРаботыПредприятия</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботыПредприятия.Resource.КоличествоЧасов</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботыПредприятия.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.Начисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <attributes>
    <name>ПоказательРасчета</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>График</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/AccumulationRegisters/УчетЗатрат/УчетЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УчетЗатрат</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/ChartsOfAccounts/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Хозрасчетный</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоХозрасчетные</extDimensionTypes>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
      <code>10</code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
    </items>
    <items>
      <name>РасходыНаПродажу</name>
      <description>Расходы на продажу</description>
      <code>44</code>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
    </items>
    <items>
      <name>РасчетыСПоставщиками</name>
      <description>Расчет с поставщиками</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПокупателями</name>
      <description>Расчеты с покупателями</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПерсоналомПоОплатеТруда</name>
      <description>Расчеты с персоналом по оплате труда</description>
      <code>70</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПодотчетнымиЛицами</name>
      <description>Расчет с подотчетными лицами</description>
      <code>71</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ПрочиеДоходыИРасходы</name>
      <description>Прочие доходы и расходы</description>
      <code>91</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
</mdclass:ChartOfAccounts>

src/Documents/НачислениеЗарплаты/ObjectModule.bsl
// Модуль объекта документа "НачислениеЗарплаты".
// Содержит основную логику проведения документа:
//   - формирование движений по регистру расчёта "Начисления" с последующим
//     принудительным расчётом сумм начислений;
//   - формирование движений по регистру "Учет затрат" (итоговые суммы по статьям);
//   - формирование бухгалтерских проводок по начисленной зарплате.

// Обработчик проведения документа.
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Начисления.Записывать = Истина;
	Движения.Хозрасчетный.Записывать = Истина;
	
	// 1. Регистр расчёта "Начисления"
	// Переносим каждую строку табличной части в движения регистра расчёта.
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно                  = Ложь;
		Движение.ВидРасчета              = ТекСтрокаНачисления.ВидРасчета;
		Движение.ПериодДействияНачало    = ТекСтрокаНачисления.ДатаНачала;
		Движение.ПериодДействияКонец     = ТекСтрокаНачисления.ДатаОкончания;
		Движение.ПериодРегистрации       = ПериодНачисления;
		Движение.БазовыйПериодНачало     = ТекСтрокаНачисления.ДатаНачала;
		Движение.БазовыйПериодКонец      = ТекСтрокаНачисления.ДатаОкончания;
		Движение.Сотрудник               = ТекСтрокаНачисления.Сотрудник;
		Движение.ПоказательРасчета       = ТекСтрокаНачисления.ПоказательРасчета;
		Движение.График                  = ТекСтрокаНачисления.ГрафикРаботы;
	КонецЦикла;  
	
	Движения.Начисления.Записать();

	Движения.Начисления.РассчитатьСуммуНачисления();    
	
	Движения.УчетЗатрат.Записывать = Истина;
	
	// 2. Запрос к записанным данным регистра расчёта для получения рассчитанных сумм
	// в разрезе статей затрат и сотрудников.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|    Начисления.Сотрудник КАК Сотрудник,
	|    Начисления.Сумма КАК Сумма,
	|    Начисления.ВидРасчета.СтатьяЗатрат КАК СтатьяЗатрат
	|ИЗ
	|    РегистрРасчета.Начисления КАК Начисления
	|ГДЕ
	|    Начисления.Регистратор = &Регистратор
	|ИТОГИ
	|    СУММА(Сумма)
	|ПО
	|    СтатьяЗатрат";
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаИтогиПоСтатье = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// 3. Запись итогов по статьям затрат в регистр "Учет затрат"
	// и формирование бухгалтерских проводок.
	Пока ВыборкаИтогиПоСтатье.Следующий() Цикл
		ДвижениеЗатрат        = Движения.УчетЗатрат.Добавить();
		ДвижениеЗатрат.Период = Дата;
		// Заполняем реквизиты движения значениями из выборки (СтатьяЗатрат, Сумма)
		ЗаполнитьЗначенияСвойств(ДвижениеЗатрат, ВыборкаИтогиПоСтатье); 
		
		// Детальный обход для формирования проводок по каждому сотруднику.
		ВыборкаДетальные = ВыборкаИтогиПоСтатье.Выбрать(); 
		Пока ВыборкаДетальные.Следующий() Цикл
			// Проводка: Дт 44 "Расходы на продажу" – Кт 70 "Расчеты с персоналом по оплате труда"
			ДвижениеХозрасчетный               = Движения.Хозрасчетный.Добавить();
			ДвижениеХозрасчетный.СчетДт        = ПланыСчетов.Хозрасчетный.РасходыНаПродажу;
			ДвижениеХозрасчетный.СчетКт        = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
			ДвижениеХозрасчетный.Период        = Дата;
			ДвижениеХозрасчетный.Сумма         = ВыборкаДетальные.Сумма;
			ДвижениеХозрасчетный.Содержание    = "Отражено начисление заработной платы сотрудникам";
			// Заполняем субконто дебета (статья затрат) и кредита (сотрудник)
			БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеХозрасчетный.СчетДт, 
			ДвижениеХозрасчетный.СубконтоДт, ВыборкаДетальные.СтатьяЗатрат);
			БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеХозрасчетный.СчетКт, 
			ДвижениеХозрасчетный.СубконтоКт, ВыборкаДетальные.Сотрудник);
		КонецЦикла;    
	КонецЦикла;        
	
КонецПроцедуры
